# 1. ገንዘብ የሚያስገባ Function ማዘጋጀት
def ገንዘብ_ያስገቡ(የነበረው_ሂሳብ, የሚገባው_ገንዘብ):
    አዲስ_ሂሳብ = የነበረው_ሂሳብ + የሚገባው_ገንዘብ
    print(f"✅ {የሚገባው_ገንዘብ} ብር ገብቷል!")
    return አዲስ_ሂሳብ  # የተደመረውን አዲስ ሂሳብ ይመልሳል


# ==========================================
# ኮዱን ስራ ላይ የማዋል ሂደት
# ==========================================

# መነሻ ገንዘብ (1000 ብር)
የእኔ_ሂሳብ = 1000
print(f"💰 መነሻ ሂሳብ፦ {የእኔ_ሂሳብ} ብር")

# 1000 ብር ማስገባት (ነጥብ '.' አያስፈልግም!)
የእኔ_ሂሳብ = ገንዘብ_ያስገቡ(የእኔ_ሂሳብ, 1000)

# አዲሱን ቀሪ ሂሳብ ማየት
print(f"💰 አሁናዊ ቀሪ ሂሳብ፦ {የእኔ_ሂሳብ} ብር")
